# TessellatedBuildIssue Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedBuildIssue Class
Members See Also
---
Types of issues encountered while constructing geometrical objects from the tessellated face sets.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class TessellatedBuildIssue : IDisposable
```

Visual Basic
---
```text
Public Class TessellatedBuildIssue _
	Implements IDisposable
```

Visual C++
---
```text
public ref class TessellatedBuildIssue : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..TessellatedBuildIssue
# See Also
TessellatedBuildIssue Members
Autodesk.Revit.DB Namespace